9/data/attachments/6602fea8e41f077c.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Angela_but_Friend_67256_1</nif:username>
            <nif:friendToBeRequested>soap_friends_b8a33106-67bf-4912-84c1-bc40c6913898</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>